app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 08 Jun 2012 23:45:27 UTC +00:00], ["name", "Adam"], ["price", #<BigDecimal:7f9daae06f38,'0.1E1',9(18)>], ["updated_at", Fri, 08 Jun 2012 23:45:27 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "price" = 1000000.0, "updated_at" = '2012-06-08 23:45:37.123834' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])